cf_billing/Reports/энргРеестрыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>энргРеестрыДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗакрытиеЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктВводаПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктВыводаПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

cf_billing/Enums/энргВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалитьэнргПерерасчет_КорректировкаПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктированиеНедопускаДопускаВПомещение_АктированиеНедопускаВПомещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_ВосстановлениеИзЗабалансаФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_СписаниеНаЗабалансФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ИзменениеКатегорииЛьготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ОтменаРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_РегистрацияЛьготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_МассовыйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_РегистрацияПоСтроению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПериодамиОспариванияЗадолженности_РегистрацияПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПериодамиОспариванияЗадолженности_СнятиеРегистрацииПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_ЗакрытиеЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_ОткрытиеЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_СменаСобственника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСРазделеннымиЛС_ОтключениеАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСРазделеннымиЛС_ПодключениеАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиМКД_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиМКД_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиТеплоисточника_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиТеплоисточника_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОткрытиеМКД_Закрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОткрытиеМКД_Открытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_ВозвратСредствПотребителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_НеправильноРаспределеннаяОплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_ПереносМеждуЛицевымиСчетами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_БлокировочныйАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ИзменениеПараметраРассчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ИзменениеПризнакаНаличияПрибораСНачалаГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_КорректировкаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_СписаниеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_ИзменениеПараметраРассчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_КорректировкаГодовогоПотребленияСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_КорректировкаПотребленногоОбъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПоказанийАбонента_РегистрацияКонтрольногоСъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПоказанийАбонента_РегистрацияПоказанийАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРеструктуризацияЗадолженности_СписаниеЗабалансовойЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРеструктуризацияЗадолженности_СписаниеНаЗабаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьДатуПоверкиПУ_ИндивидуальныйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьДатуПоверкиПУ_СвязанныеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Извещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_ПередачаПакетаДокументовЮристам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_РегистрацияИсполнительногоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_РешениеСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменитьСпособДоставкиЕПДАбонентам_ИндивидуальныйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменитьСпособДоставкиЕПДАбонентам_МассовыйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ЗакрытиеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ОтключениеАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ОткрытиеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ПодключениеАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиПомещений_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиПомещений_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ПерерасчетНенадлежащегоКачества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргНастройкаРассрочки_ОбщаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргНастройкаРассрочки_ИндивидуальнаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСТочкамиПоставки_ОтключениеТочкиПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаМКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ПереносВозвратОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_МассовоеСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_ЗагрузкаПоказанийИзВнешнихИсточников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ОграничениеРежимаПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ВозобновлениеРежимаПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктНесанкционированногоПодключенияВмешательства_Подключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктНесанкционированногоПодключенияВмешательства_Вмешательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргКорректировкаПениПоСудебномуРешению_КорректировкаПениПоСудебномуРешению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргКорректировкаПениПоСудебномуРешению_РучнаяКорректировкаПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПретензийОтПотребителяИсполнителя_РегистрацияПретензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПретензийОтПотребителяИсполнителя_АннулированиеПретензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_РаспределениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ЗагрузкаРеестраЕИРЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеПоРассрочке_РеструктуризацияЗадолженностиФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеПоРассрочке_ЗакрытиеЗадолженностиФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияРасчетаПениАбонента_ИсключениеРасчетаПениАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияРасчетаПениАбонента_ВозобновлениеРасчетаПениАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияВременногоОтсутствия_ПериодОтсутствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияВременногоОтсутствия_КорректировкаПериодаОтсутствия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Reports/энргРеестрыДокументов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
		
КонецПроцедуры

// Вызывается в одноименном обработчике формы отчета после выполнения кода формы.
//
// Подробнее - см. ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере
//
Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	 	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка 		= Ложь;
	
	
	СхемаКомпоновкиДанных 		= ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	пВарианты = СхемаКомпоновкиДанных.ВариантыНастроек;
	
	СтруктураВариантов = Новый Структура;
	Для Каждого пЭл ИЗ пВарианты Цикл
		СтруктураВариантов.Вставить(пЭл.Имя,пЭл.Настройки);
	КонецЦикла;
	
	//Если ЗакрытиеЛС Тогда
	//	пНастройки = СтруктураВариантов.ЗакрытиеЛС;
	//ИначеЕсли АктВводаПУ Тогда
	//	пНастройки = СтруктураВариантов.АктУстановкиПУ;
	//ИначеЕсли АктВыводаПУ Тогда
	//	пНастройки = СтруктураВариантов.АктСнятияПУ;
	//КонецЕсли;
	Если ВидДокумента = Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС Тогда
		пНастройки = СтруктураВариантов.ОткрытиеЛС;
	ИначеЕсли ВидДокумента = Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС Тогда 
		пНастройки = СтруктураВариантов.ЗакрытиеЛС;
	ИначеЕсли ВидДокумента = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ Тогда 
		пНастройки = СтруктураВариантов.АктСнятияПУ;
	ИначеЕсли ВидДокумента = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ Тогда 
		пНастройки = СтруктураВариантов.АктУстановкиПУ;
	ИначеЕсли ВидДокумента = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ Тогда 
		пНастройки = СтруктураВариантов.АктЗаменаПУ;
	ИначеЕсли ВидДокумента = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги Тогда 
		пНастройки = СтруктураВариантов.ПодключениеУслуг;
	ИначеЕсли ВидДокумента = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги Тогда 
		пНастройки = СтруктураВариантов.ОтключениеУслуг;
	ИначеЕсли ВидДокумента = "Приходный кассовый ордер" Тогда 
		пНастройки = СтруктураВариантов.ПКО;
	КонецЕсли;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(пНастройки);
	Настройки					= КомпоновщикНастроек.Настройки;
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНач",	 ДатаНач);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКон",	 КонецДня(ДатаКон));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидОперации", ВидДокумента);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЗакрытиеЛС", 	ЗакрытиеЛС);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("АктВводаПУ", 	АктВводаПУ);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("АктВыводаПУ", 	АктВыводаПУ);
	
	ДанныеРасшифровки 			= Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;

	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ,ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода 			= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
